software/projects/mirth-deploy/src/test/resources/payloads_consent/RegisterConsentCollectionProtocolNotExist.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:mes="http://caXchange.nci.nih.gov/messaging">
	<soapenv:Header />
	<soapenv:Body>
		<mes:caXchangeRequestMessage>
			<mes:metadata>
				<mes:transactionControl>?</mes:transactionControl>
				<mes:serviceType>iHub</mes:serviceType>
				<!--Optional: -->
				<mes:operationName>Register Consent</mes:operationName>
				<mes:externalIdentifier>32225879</mes:externalIdentifier>
				<!--Optional: -->
				<mes:caXchangeIdentifier />
				<!--Optional: -->
				<mes:credentials>
					<!--You have a CHOICE of the next 3 items at this level -->
					<mes:userName>tolvenuser</mes:userName>
					<mes:groupName>nogrid</mes:groupName>
					<mes:gridIdentifier>nogrid</mes:gridIdentifier>
					<!--Optional: -->
					<mes:password>changeme</mes:password>
					<!--Optional: -->
					<mes:delegatedCredentialReference>nocredentials</mes:delegatedCredentialReference>
				</mes:credentials>
			</mes:metadata>
			<mes:request>
				<mes:businessMessagePayload>
					<mes:xmlSchemaDefinition>urn:tolven-org:trim:4.0</mes:xmlSchemaDefinition>
					<trim xmlns="urn:tolven-org:trim:4.0">
						<consents xmlns="http://cacis.nci.nih.gov">
							<participant>
								<cdmsSubjectId>66604232</cdmsSubjectId>
							</participant>
							<consentsDetailsList>
								<consentDetails>
									<collectionProtocolEvent>CPL</collectionProtocolEvent>
									<specimen>
										<cdmsSpecimenId>TolvenTestUser252TissueSpecimen153
										</cdmsSpecimenId>
									</specimen>
									<collectionProtocol>
										<title>Tolven Tissue Protocol123</title>
										<shortTitle>ttp123</shortTitle>
									</collectionProtocol>
									<consentTierResponses>
										<tier>
											<statement>This is a statement</statement>
											<response>Yes</response>
										</tier>
										<tier>
											<statement>This is a second statement.</statement>
											<response>No</response>
										</tier>
									</consentTierResponses>
								</consentDetails>
								<consentDetails>
									<collectionProtocolEvent>CPL</collectionProtocolEvent>
									<specimen>
										<cdmsSpecimenId>TolvenTestUser252TissueSpecimen173
										</cdmsSpecimenId>
									</specimen>
									<collectionProtocol>
										<title>Tolven Tissue Protocol</title>
										<shortTitle>ttp</shortTitle>
									</collectionProtocol>
									<consentTierResponses>
										<tier>
											<statement>This is a statement</statement>
											<response>Not Specified</response>
										</tier>
										<tier>
											<statement>This is a second statement.</statement>
											<response>Withdrawn</response>
										</tier>
									</consentTierResponses>
								</consentDetails>
							</consentsDetailsList>
						</consents>
					</trim>
				</mes:businessMessagePayload>
			</mes:request>
		</mes:caXchangeRequestMessage>
	</soapenv:Body>
</soapenv:Envelope>