software/projects/mirth-deploy/src/test/resources/payloads_participant/Participant.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://caXchange.nci.nih.gov/messaging">    <soapenv:Header/>    <soapenv:Body>       <mes:caXchangeRequestMessage>          <mes:metadata>             <mes:transactionControl>?</mes:transactionControl>             <mes:serviceType>iHub</mes:serviceType>             <!--Optional:-->             <mes:operationName>Create Participant Registration</mes:operationName>             <mes:externalIdentifier>322XXXXXX</mes:externalIdentifier>             <!--Optional:-->             <mes:caXchangeIdentifier/>             <!--Optional:-->             <mes:credentials>                <!--You have a CHOICE of the next 3 items at this level-->                <mes:userName>tolvenuser</mes:userName>                <mes:password>changeme</mes:password>             </mes:credentials>          </mes:metadata>          <mes:request>             <mes:businessMessagePayload>                <mes:xmlSchemaDefinition>urn:hl7-org:v3</mes:xmlSchemaDefinition>                <ClinicalDocument xsi:schemaLocation="urn:hl7-org:v3 ../cdaXSD/infrastructure/cda/CDA.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3">                   <realmCode code="US"/>                   <typeId root="2.16.840.1.113883.1.3" extension="POCD_HD000040"/>                   <!--US Realm Header, consolidated CDA header template-->                   <templateId root="2.16.840.1.113883.10.20.22.1.1" assigningAuthorityName="HL7 CCDA"/>                   <id root="1.2.1.173000" extension="echr:patient-1823431:clinicalNote-1833300"/>                   <!--There is no existing LOINC code for Registration report.-->                   <code nullFlavor="OTH">                      <originalText>Registration report</originalText>                   </code>                   <title>Registration report</title>                   <effectiveTime value="20110722085054-0700"/>                   <confidentialityCode code="N"/>                   <languageCode code="en-US"/>                   <recordTarget>                      <patientRole>                         <!--study subject identifier-->                         <id root="1.2.1.173000" extension="echr:patient-1823467" assigningAuthorityName="iSpy2 Study"/>                         <!--patient MRN-->                         <id root="1.2.1.173000" extension="2131823467" assigningAuthorityName="ABC Cancer Institute"/>                                              <addr nullFlavor="NI"/>                         <telecom nullFlavor="NI"/>                         <patient>                            <name use="L">                               <given>FirstName67</given>                               <given/>                               <family>LastName67</family>                            </name>                            <!--gender-->                            <administrativeGenderCode code="F" codeSystem="2.16.840.1.113883.5.1" displayName="Female"/>                            <!--birth date-->                            <birthTime value="19670131"/>                            <!--marital status-->                            <maritalStatusCode code="M" codeSystem="2.16.840.1.113883.5.2" codeSystemName="HL7 MaritalStatus" displayName="Married">                               <originalText>Now married</originalText>                            </maritalStatusCode>                            <!--race-->                            <raceCode code="2106-3" displayName="White" codeSystem="2.16.840.1.113883.6.238" codeSystemName="Race &amp; Ethnicity - CDC"></raceCode>                            <!--ethnicity-->                            <ethnicGroupCode code="2186-5" displayName="Not Hispanic or Latino" codeSystem="2.16.840.1.113883.6.238" codeSystemName="Race &amp; Ethnicity - CDC"/>                         </patient>                      </patientRole>                   </recordTarget>                   <author>                      <time nullFlavor="NI"/>                      <assignedAuthor>                         <id root="1.2.1.173000" extension="matthew.salesi@ucsfmedctr.org"/>                         <addr nullFlavor="NI"/>                         <telecom nullFlavor="NI"/>                         <assignedPerson>                            <name nullFlavor="NI"/>                         </assignedPerson>                      </assignedAuthor>                   </author>                   <custodian>                      <assignedCustodian>                         <representedCustodianOrganization>                            <id root="2.16.840.1.113883.3.26.1.7" extension="TranscendTolven"/>                            <name nullFlavor="NI"/>                            <telecom nullFlavor="NI"/>                            <addr nullFlavor="NI"/>                         </representedCustodianOrganization>                      </assignedCustodian>                   </custodian>                   <!--site id-->                   <documentationOf>                      <serviceEvent classCode="CLNTRL">                         <id root="2.16.840.1.113883.3.26.1.7" extension="echsite87"/>                         <code nullFlavor="OTH">                            <originalText>site-specific component of clinical trial</originalText>                         </code>                      </serviceEvent>                   </documentationOf>                   <!--study id-->                   <documentationOf>                      <serviceEvent classCode="CLNTRL">                                                 <id root="6482" extension="6482"/>                         <code nullFlavor="OTH">                            <originalText>clinical trial</originalText>                         </code>                      </serviceEvent>                   </documentationOf>                   <component>                      <structuredBody>                         <component>                            <section>                               <!--no existing CDA template, use a generic section to convey activity status data-->                               <title>Registration</title>                               <text>                                  <content>Activity status:</content>                                  active                               </text>                               <entry typeCode="DRIV">                                  <!--no particular existing activity status CDA template, use result observation template to record registration status-->                                  <observation classCode="OBS" moodCode="EVN">                                     <!--Result observation template-->                                     <templateId root="2.16.840.1.113883.10.20.22.4.2" assigningAuthorityName="HL7 CCDA"/>                                     <id nullFlavor="NI"/>                                     <code code="263490005" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED-CT" displayName="Activity status"/>                                     <value xsi:type="CD" code="55561003" codeSystem="2.16.840.1.113883.6.96" displayName="active" codeSystemName="SNOMED-CT"/>                                  </observation>                               </entry>                            </section>                         </component>                         <component>                            <section>                               <!--HL7 consolidated CDA social history section template-->                               <templateId root="2.16.840.1.113883.10.20.22.2.17" assigningAuthorityName="HL7 CCDA"/>                               <code code="29762-2" displayName="social history" codeSystem="2.16.840.1.113883.6.1"/>                               <title/>                               <text/>                               <!--no existing CDA template, use result observation template to record additional race. If a patient only has a single race code, then the code should be put to CDA header recordTarget/.../patient/raceCode element-->                               <entry typeCode="DRIV">                                  <observation classCode="OBS" moodCode="EVN">                                     <!--Result observation template-->                                     <templateId root="2.16.840.1.113883.10.20.22.4.2" assigningAuthorityName="HL7 CCDA"/>                                     <id root="0b1f04da-983c-4438-a093-31011a5f9758"/>                                     <code code="103579009" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED-CT" displayName="race"/>                                     <value xsi:type="CD" code="1002-5" displayName="American Indian or Alaska Native" codeSystem="2.16.840.1.113883.6.238" codeSystemName="Race &amp; Ethnicity - CDC"/>                                  </observation>                               </entry>                            </section>                         </component>                      </structuredBody>                   </component>                </ClinicalDocument>             </mes:businessMessagePayload>          </mes:request>       </mes:caXchangeRequestMessage>    </soapenv:Body> </soapenv:Envelope>